<style lang="less" scoped src="./css/register_protocol.css">

</style>
<template>
	<div class="protocol_container">
		<div class="protocol_top">
			<span>{{company_name}} 用户注册协议</span>
			<span class="iconfont" @click="close">&#xe63c;</span>
		</div>
		<div class="protocol_text">
			<div>
				<p>一、协议说明</p>
				本协议是您与{{company_name}}网站（简称“{{company_name}}”）之间就{{company_name}}服务等相关事宜所订立的契约，请您仔细阅读本协议，您点击“同意”按钮后，本协议即构成对双方有约束力的法律文件。
				<p>二、服务条款的确认和接纳</p>
				1.{{company_name}}的各项电子服务的所有权和运作权归{{company_name}}所有。用户同意所有服务协议条款并完成注册程序，才能成为{{company_name}}的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。
				2.用户点击同意本协议的，即视为用户确认自己具有享受{{company_name}}服务等相应的权利能力和行为能力，能够独立承担法律责任。
				3.如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用{{company_name}}。
				4.{{company_name}}保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容的权利。
				<p>三、社区基本守则</p>
				{{company_name}}通过即时跟随交易的模式，以期为交易市场上的投资增加回报，提升盈利投资人数比例。{{company_name}}社区是以建立投资策略为导向，分享投资策略和投资知识。因此，{{company_name}}制定了一套社区基本守则，请广大用户知悉。
				社区信息只是为了给投资提供参考信息，让投资用户在此可以相互学习、分享、互动，并不构成任何投资建议和推荐，投资完全取决于您的个人独立思考和决策，{{company_name}}并不会对投资的盈利亏损承担任何责任。
				1. 社区是给交易员和投资人提供交流的平台，以便投资人通过交流、了解选择信任的交易员跟随投资，也方便交易员向投资人分享自己的专业投资知识，以达到相互了解选择跟随投资对象的目的。
				2. 社区信息可能为{{company_name}}合作伙伴、金融机构及用户等第三方所提供的信息，{{company_name}}不保证信息的可靠性和真实性，因此，与{{company_name}}合作的第三方向用户提供产品、服务，并提供该产品、服务的维护、客服等后续工作，应由该第三方对该产品、服务的质量问题或其本身的原因导致的一切纠纷或用户的损失承担责任，用户在此同意将向该第三方主张与此有关的一切权利和损失。
				3.{{company_name}}信息发布者只对其发布内容的合法性承担责任，并不会对据此操作的投资所产生的盈利亏损承担任何责任。
				4. 任何在社区发布信息的行为仅代表其个人，{{company_name}}设定官方账号对产品技术服务的行为代表{{company_name}}官方立场。
				5. {{company_name}}社区作为一个外汇交流平台，只提供软件使用服务，不提供官方操作策略以及交易员，所有社区的交易员以及策略均为第三方个人或者团队发布，纯粹作为交流互动用途，请用户自行判断风险，出现赢利与亏损均与{{company_name}}无关。
				6. {{company_name}}在提供跟随服务的过程中，因技术系统需要用户配合提供交易账号密码时，客户自愿提供，{{company_name}}仅用于绑定社区跟随系统以让用户达到一键跟随的目的，纯属技术用途。
				<p>四、社区言论内容规范</p>
				{{company_name}}社区主要分享投资经验、投资策略、研究及分析行情等相关的金融投资信息，希望社区用户积极发言及分享，并参与讨论相关范围内容。
				<p>五、社区微博管理</p>
				为了维护广大{{company_name}}用户的合法权益，提供健康文明的社区环境，创造和谐的社交氛围，根据《全国人大常委会关于维护互联网安全的决定》、《互联网信息服务管理办法》、《互联网用户账号名称管理规定》等现行法律法规，{{company_name}}明确制定社区各类违规现象及相应处罚准则。
				1. 使用不文明不健康用语（侮辱、歧视、猥亵类等词句）进行人身攻击、地域攻击、民族歧视等，经发现即限制展示或删除，并视情节严重程度对发布该内容的用户予以警告、禁言或停用账号处理。
				2. 发布触及现行法律法规，危害用户和{{company_name}}安全及合法权益的信息，一旦发现即停止展示或删除，并视情节严重程度对发布该信息的用户予以警告、禁言或停用账号、向有权司法机关举报处理。
				3. 发布垃圾信息破坏网络环境的，如反复发布与主题无关的评论、垃圾广告等，对其他用户造成干扰且被投诉的，将视情节严重程度予以警告、禁言或停用账号处理。
				4. 乱发广告信息，如销售广告、咨询广告、股票网站等，一经发现立即删除，禁言或停用账号处理。
				5. 胡乱发布淫秽、色情、暴力、迷信和犯罪等信息的，经发现加以清除，并视情节严重程度对该信息发布用户予以禁言或停用账号、向有权司法机关举报处理。
				6. 侵犯他人合法权益（名誉权、肖像权、知识产权等）的行为，以及传播病毒代码、黑客程序等妨害第三方权益的文件和信息，一经发现将对该用户予以禁言、停用账户处理。
				7. 用户头像、昵称以及个人简介涉及敏感时政、反动等内容，限期修改；逾期未改，将视情节严重程度予以禁言或停用账户处理。
				8. 用户账号头像、昵称、简介及言论侵犯他人（包括自然人和法人）名誉权、肖像权、隐私权、知识产权、商业机密等合法权益，视情节严重程度予以限制展示、删除、警告、禁言或者停用账户处理。
				9. {{company_name}}商学院所发布的内容需遵守国家相关法律法规，不得在视频、文字内容中体现任何的联系方式以及国家政策不允许的术语，一经发现，做视频下架处理。
				10. 发布QQ号、QQ群、微信公众号、微信群号、微信二维码，以及未经{{company_name}}允许的第三方活动信息、推广信息、销售信息等营销信息，一经发现将对该用户予以禁言、停用账户处理。
				本守则自公布之日起施行。对违反{{company_name}}社区规则的账户予以规定的警告、禁言、停用账户处理。禁言是{{company_name}}社区的主要处罚机制，被禁言的用户无法评论、转发、评赞、修改个人信息，只能浏览网页，禁言期后可恢复正常。禁言处罚视情节严重程度可分为禁言时间为3天、禁言时间为7天、禁言时间为15天或永久性禁言。
				如对{{company_name}}社区处罚机制有任何疑问或异议，可向{{company_name}}官方发送邮件进行申诉。
				<p>六、言论可信度</p>
				{{company_name}}社区用户均有发言权，仅代表其个人立场，投资需根据您个人独立思考作出判断和决策。在{{company_name}}社区中，{{company_name}}设定的官方账号对{{company_name}}自身产品、技术相关问题作出的言论代表{{company_name}}官方立场。
				<p>七、版权说明</p>
				1.用户一旦接受本协议，即表明该用户主动将其在任何时间段在{{company_name}}发表的任何形式的信息内容（包括但不限于评价、咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给{{company_name}}所有，用户同意{{company_name}}有权就任何主体侵权而单独提起诉讼。
				2.用户同意并已充分了解本协议的条款，承诺不将已发表于{{company_name}}的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。
				3.我司是{{company_name}}的制作者,拥有此网站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及{{company_name}}的内容进行修改，并在{{company_name}}张贴，无须另行通知用户。在法律允许的最大限度范围内，{{company_name}}对本协议及{{company_name}}其他内容拥有解释权。
				4.若出于非商业、非盈利、非广告性目的，任何试图将{{company_name}}网站社区的内容转载、引用到其他地方，需注明内容原出处。如涉及侵权事宜，版权方可向{{company_name}}进行投诉，并提供相关证明版权的资料，{{company_name}}在核实后将会进行处理。
			</div>
		</div>
		<div class="btn" @click="agree"><button>同意并继续</button></div>
	</div>

</template>
<script>
    import { COMPANY_NAME } from 'store/company'
    export default {
        data() {
            return {
                company_name:COMPANY_NAME,
            }
        },
        methods:{
        	close(){
        	 	this.$emit('close')
        	},
        	agree(){
        		this.close()
        	 	this.$emit('agree')
        	}
        }
    }
</script>