<?php
/**
 * Created by cys.
 * User: Administrator
 * Date: 2017/9/1
 * Time: 18:04
 */
return [
    'addAccount' => [
        '1'=>'加密字符串错误',
        '10'=>'交易账号格式错误',
        '20'=>'平台不存在',
        '30'=>'密码格式错误',
        '500'=>'数据系统服务器内部错误'
    ],
    'delAccount' => [
        '1'=>'加密字符串错误',
        '10'=>'类型错误',
        '500'=>'数据系统服务器内部错误'
    ],
    'changePwd' => [
        '1'=>'加密字符串错误',
        '10'=>'类型错误',
        '20'=>'喊单账号不存在',
        '500'=>'数据系统服务器内部错误'
    ],
    'getApiOpen' => [
        '1'=>'加密字符串错误',
        '10'=>'账号无效',
        '20'=>'平台不存在',
        '500'=>'数据系统服务器内部错误'
    ],
    'getApiClose' => [
        '1'=>'加密字符串错误',
        '10'=>'账号无效',
        '20'=>'平台不存在',
        '30'=>'开始时间无效',
        '40'=>'结束时间无效',
        '500'=>'数据系统服务器内部错误'
    ],
    'getOpenOrders' => [
        '1'=>'加密字符串错误',
        '500'=>'数据系统服务器内部错误'
    ],
    'getCloseOrders' => [
        '1'=>'加密字符串错误',
        '500'=>'数据系统服务器内部错误'
    ],
    'getAccountInfor' => [
        '1'=>'加密字符串错误',
        '500'=>'数据系统服务器内部错误'
    ],
    'getOpenFail' => [
        '500'=>'数据系统服务器内部错误'
    ],
    'getCloseFail' => [
        '500'=>'数据系统服务器内部错误'
    ],
    'getLoginFail' => [
        '500'=>'数据系统服务器内部错误'
    ],
    'getStatus' => [
        '1'=>'加密字符串错误',
        '500'=>'数据系统服务器内部错误'
    ],


];