<?php
/**
 * Created by cys.
 * User: Administrator
 * Date: 2017/9/1
 * Time: 18:04
 */
return [

    //新格式
    'addAccount' => [
        '1'=>'加密字符串错误',
        '10'=>'交易账号格式错误',
        '20'=>'平台不存在',
        '30'=>'密码格式错误',
        '500'=>'跟单系统服务器内部错误'
    ],
    'delAccount' => [
        '1'=>'加密字符串错误',
        '10'=>'类型错误',
        '500'=>'跟单系统服务器内部错误'
    ],
    'changePwd' => [
        '1'=>'加密字符串错误',
        '10'=>'类型错误',
        '20'=>'喊单账号不存在',
        '500'=>'跟单系统服务器内部错误'
    ],
    'follow' => [
        '1'=>'加密字符串错误',
        '10'=>'跟单者交易账号格式错误',
        '20'=>'跟单者平台不存在',
        '30'=>'跟单者密码格式错误',
        '50'=>'喊单者账号不存在',
        '60'=>'相同跟单已经存在',
        '500'=>'跟单系统服务器内部错误'
    ],
    'changeFollow' => [
        '1'=>'加密字符串错误',
        '10'=>'没有找到对应策略',
        '500'=>'跟单系统服务器内部错误'
    ],
    'setStop' => [
        '1'=>'加密字符串错误',
        '500'=>'跟单系统服务器内部错误'
    ],
    'getApiOpen' => [
        '1'=>'加密字符串错误',
        '10'=>'账号无效',
        '20'=>'平台不存在',
        '500'=>'跟单系统服务器内部错误'
    ],
    'getApiClose' => [
        '1'=>'加密字符串错误',
        '10'=>'账号无效',
        '20'=>'平台不存在',
        '30'=>'开始时间无效',
        '40'=>'结束时间无效',
        '500'=>'跟单系统服务器内部错误'
    ],
    'getOpenOrders' => [
        '1'=>'加密字符串错误',
        '500'=>'跟单系统服务器内部错误'
    ],
    'getCloseOrders' => [
        '1'=>'加密字符串错误',
        '500'=>'跟单系统服务器内部错误'
    ],
    'getAccountInfor' => [
        '1'=>'加密字符串错误',
        '500'=>'跟单系统服务器内部错误'
    ],
    'getOpenFail' => [
        '500'=>'跟单系统服务器内部错误'
    ],
    'getCloseFail' => [
        '500'=>'跟单系统服务器内部错误'
    ],
    'getLoginFail' => [
        '500'=>'跟单系统服务器内部错误'
    ],
    'getStatus' => [
        '1'=>'加密字符串错误',
        '500'=>'跟单系统服务器内部错误'
    ],


];