<style lang="css" scoped src="./css/index.css"></style>

<template>
    <div class="becomeTrader_step3_content cl" >
        <Modal v-model="iviewModal" class-name="ivu-modal-custom ivu-modal-middle" :mask-closable="false">
            <div class="success_content">
                <div class="success_top">
                    <span>签约成功</span>
                </div>
                <div class="success_middle">
                    <p>恭喜，您已经成为签约交易员！</p>
                    <span>发布交易策略并且邀请投资跟随者，您将获得丰厚佣金回报</span>
                </div>
                <div class="button" @click="know">我知道了</div>
            </div>
        </Modal>
        <!--http://www.zhonghui.com/#/register?invitationCode=1516866949-->
        <!--1516866949-->

        <div class="content_top">请仔细阅读协议中的条款</div>
        <div class="content cl">
            <div class="top cl">
                <span>交易员入驻协议</span>
                <i class="iconfont"  @click="hideAgreement">&#xe63c;</i>
            </div>
            <div class="text_content" v-show="agreement">
                <p>
                    交易员协议（以下称“本协议”）是和交易员（以下简称“您”）之间共同达成的法定协议条款，请您务必仔细阅读本协议全部内容。
                    若您已开通交易员账户，则表明您接受本协议所有条款内容并接受本协议条款的约束。届时您不应该以未阅读本协议的内容或未获取对您问询
                    的解答等理由，主张本协议无效或要求撤销本协议。如果您不同意本协议的约定，您应该立即终止在网站开通交易员账户。
                </p>
                <p>
                    本协议由（“本公司”）（以下简称为“”）与在网站（“合作方”）上的已注册登记并已明确接受此等条款和条件的自然人、法人或者其他组
                    织共同签署。
                </p>
                <p>
                    第一条 协议内容及签署
                </p>
                本协议内容包括协议正文及所有已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
                任何提供的服务均受本协议约束。<br>
                为维护的合法权益和完善本协议，保留修改本协议相关条款的权利和最终解释权。如果修改本协议相关条款，将通过官网（或电子邮件
                等通信手段）作出必要的特定通知。请您在享用各项服务时，及时查阅了解相关修订内容，并自觉遵守履行本协议相关服务协议。即使修订交易条件和
                执行规则任何部分，您都将继续受本协议的约束。<br>
                若您仍继续使用在网站开通交易员账户的，即表示您接受修订协议的规则。
                <p>
                    第二条 账户与安全
                </p>
                2.1主体资格<br>
                您确认，当您在汇大师网站开通交易员账户时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若自然人用户不具备前述主体资格，则应由您及您的监护人承担因此而导致的一切后果，汇大师将撤销其所得服务费并将您的交易员账户永久停用，且有权向您及您的监护人索偿相应损失。
                2.2注册与使用<br>
                   &nbsp 1) 当您按照汇大师网站提供个人资料（如真实的身份信息、联络地址、联系方式以及交易经历、交易策略等），经过汇大师严格核实和评估后，若您符合汇大师规定的交易员条件，汇大师将允许您开设交易员账户。自您的交易员账户开通之日起，您即受本协议约束。<br>
                   &nbsp 2) 您的交易员账户不得以任何方式买卖、转让、赠与或继承，除非有法律明确规定或司法裁定，并经汇大师同意，且需提供汇大师要求的合格的文件材料并根据汇大师制定的操作流程办理。未按上述流程进行买卖、转让、赠与或继承的，汇大师将撤销其所得服务费并将您的交易员账户永久停用。<br>
                   &nbsp 3) 当您按照汇大师网站提供个人资料时，您应当依照法律法规要求，汇大师按相应页面的提示准确提供您的资料，并于资料信息变更时及时更新，以保证您所提交资料的真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，有权向您发出问询及/或要求及时更正的通知，并有权直接做出删除相应资料的处理，甚至停用您的交易员账户的使用。汇大师对此将不承担任何责任，由您自行承担因此产生的全部直接或间接损失及不利后果。<br>
                  &nbsp 4) 您应当准确填写并及时更新您提供的联系方式，以便汇大师与您取得联系，因通过这些联系方式无法与您取得联系，导致您在使用本服务过程中产生任何损失或承担任何法律责任的，应由您完全独自承担。您了解并同意，您有义务保证你提供的联系方式的真实性和有效性，如有变更的，您应按汇大师的要求进行操作。<br>
                  &nbsp 5）账户的注销<br>
                    &nbsp &nbsp a. 如您申请注销交易员账户的，您应当根据汇大师的要求提交资料，经汇大师审核过后，办理注销账户事宜，同时汇大师会终止您交易账户的使用。<br>
                    &nbsp &nbsp b. 您同意并授权汇大师，如果您存在欺诈、发布虚假交易信息或其他侵犯他人合法权益或其他违反法律法规、汇大师制定的规则等行为，汇大师有权披露您的相关信息，且会导致您的交易账户被注销或者无法登录等情形，并且由您自行承担相应的法律责任。<br>
                    6) 账户安全<br>
                您应妥善保管您的账号和密码。因您保管不善而可能导致账号或密码失窃的，责任由您自行承担。且您须对在该登录名下发生的所有活动承担责任，汇大师不承担由此造成的一切法律责任。<br>
                您知悉并认可：<br>
                   &nbsp &nbsp a. 如果发现任何账户安全问题，您应立即采取有效方式通知汇大师，并授权汇大师采取合理的措施；您认可汇大师对您的任何请求采取行动均需要合理的时间，除汇大师存在过错外，汇大师对在采取行动前已经产生的后果不承担任何责任。<br>
                  &nbsp &nbsp b. 为确保您在每个上网时段结束时，以正确步骤离开网站。您理解并同意给予汇大师合理的时间对您提出请求做出相应的处理及提供解决方案，汇大师对在汇大师网站采取行动前已经产生的任何后果（包括但不限于您遭受的任何损失及/或承担的责任）不承担任何法律责任。<br>
                  &nbsp &nbsp c. 您在汇大师网站平台上所产生的一切交易活动所引发的法律责任、债权债务关系系及您与交易方的合作，汇大师不为此承担任何风险和法律责任。

                <p>
                  第三条  个人信息的保护
              </p>
                1. 汇大师深知您珍视个人隐私，并理解保护您个人信息的重要性。汇大师将按照相关法律法规的规定收集、使用、保存、披露和保护您的个人信息。<br>
                2. 您在使用交易员账户的过程中，可能需要填写一些必要的用户个人信息。您应当保证填写的身份信息为真实、可靠、完整的。您知悉并认可，若您填写的信息不完整，则无法通过汇大师核实和评估。汇大师有权限制或禁止您开设交易员账户。<br>
                3. 您不得冒用他人资料（如姓名、身份证号码、手机号码、银行卡号码等），如果您提供的资料不真实、不合法或无效，汇大师有权禁止您使用汇大师的产品和服务。<br>
                4. 若您的个人信息有变更或想变更账户类型，您可通过邮件形式向汇大师客服提出申请。汇大师在查阅审核之后将作出处理。如您不能及时通知汇大师关于个人信息变更，针对变化而出现错误的资料信息，汇大师不承担任何责任。为确保个人信息的准确和实时更新，您可要求汇大师更正或删除个人认为不正确的信息。<br>
                5. 汇大师将应用各种安全技术和程序建立完善的管理制度来保护您的个人信息以免遭受未经授权的访问、使用或披露。<br>
                6. 汇大师非经您的许可或根据相关法律、法规的强制性规定，不会透露您的个人信息。如您涉嫌侵犯他人合法权益，则经汇大师初步审核确有涉嫌侵权行为存在的情况下，汇大师有权向权利人提供您的相关个人信息。汇大师承诺并保证这些信息仅用于核实实际情况并向用户提供更适合需要的服务。<br>
                7. 汇大师非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用本服务前，应事先取得您家长或法定监护人的书面同意。<br>
                8. 您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，汇大师可对您发布的信息依法或依本协议进行删除或屏蔽。<br>

                <p>
                    第四条  交易员使用规范
                </p>
                <span>您承诺在使用交易员账户的过程中，您应遵守以下约定：</span>
                1. 请您务必仔细查阅汇大师官网的相关条款，了解相关法律法规，并承担您本人进行交易的所有风险。<br>
                2. 本协议依据国家相关法律法规及规章制定，您应当承担以下责任：<br>
                    &nbsp 1) 不得干扰本站的正常运转，不得侵入本站信息系统；<br>
                    &nbsp 2) 不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料，包括文字、图片、音频等；<br>
                    &nbsp 3) 不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；<br>
                    &nbsp 4) 不得发布任何侵犯他人合法权利的内容；<br>
                    &nbsp 5) 不得教唆他人从事本条所禁止的行为；<br>
                汇大师保有删除网站内各类不符合法律政策或不真实的信息内容而无须通知您的权利。若您未遵守以上规定的，本站有权作出独立判断并采取暂停或终止提供产品和服务等措施。<br>
                3. 请您定期检查账户信息，并及时把任何错误告知汇大师。如交易执行后72小时内，您没有把发生的任何错误告知汇大师，由此所造成的任何损失及损害均由您本人承担。<br>
                4. 您在汇大师平台的交易策略描述必须准确，以便跟随者根据此描述进行跟随投资。您的交易行为必须与策略描述相符合。当您的实际交易方式与策略描述有出入时，汇大师将不批准此交易策略通过；情况严重者，汇大师将采取相关行动干涉您的交易活动，如停用您的账户或切断跟随者的跟随信号。<br>
                5. 交易员需确保及时更新交易状态，以便跟随者及时了解其交易行为及策略，从而维护良好的跟随关系。<br>
                6. 您和投资者进行互动交流时，需对自己的言论负责。在您发布策略，让投资者进行跟随的过程中，因您修改信号源账号的观摩密码，造成投资者无法正常跟随，由此导致的亏损，由您承担。<br>
                7. 不得发表任何诽谤及损害汇大师名誉的不良言论。<br>
                8. 不得恶意操作，如为提升跟随人数或资金而进行的恶意刷单行为等，否则汇大师将撤销其所得服务费且其交易员账户可能被永久停用。<br>
                9. 您在汇大师交易期间所获得的跟随服务费，汇大师将按相应制度返还，每月为一周期。每月1日至5日，累计服务费达30美元以上，您可在个人账户中申请取款。汇大师审核通过后，将在三个工作日内向您提供的银行账户支付。除此期间外，不得申请取款。<br>
                10.如果您违反规定被停止使用交易员账户，或因自愿退出交易员排行停止使用交易员账户，则剩余服务费在30日内可向汇大师一次性申请。申请通过审核后才可提取。<br>

                <p>
                    第五条  汇大师的权利和义务
                </p>
                1. 您上传发布到汇大师的资料信息（如文字、图片等，不包括身份证、银行卡及个人隐私资料信息），汇大师有权将内容用于其他合法途径，如复制、修改、改编、翻译、推广、分析等。<br>
                2. 汇大师网站上所有图文信息均出于为公众传播有益资讯信息之目的，不意味着汇大师赞同其观点。<br>
                3. 汇大师不会向您提供任何投资建议，也不发表与投资相关的任何意见，需您本人独立思考和自主执行交易。<br>
                4. 如您的账号连续超过2个月没有任何交易行为，将被系统从汇大师交易员的排名榜中剔除。<br>
                5. 为保护您与汇大师双方的合法权益，汇大师有权依据您提供给汇大师的信息对您的知识、经验和适应性进行评估。若汇大师认为您提供的信息不可靠或不准确，将不予以通过。<br>
                6. 任何自然人、法人或者其他组织未经合法授权，给汇大师提供他人交易数据或相关信息的行为，汇大师不为此行为造成的任何损失负责。<br>
                7. 汇大师将为您提供一个公平、公开、公正的交易员排行榜，以展示交易员信息。<br>
                8. 对于交易员发布的策略，汇大师将进行评分和排名，将优秀交易员信息发布在官网上，方便您能够获得更详细的信息，并设置该策略的最大跟随人数和最大跟随资金。<br>
                9. 汇大师会将热门交易员和明星交易员的个人信息、昵称、跟随获利总额等信息优先置顶在汇大师网站首页，并提供受访谈栏目及媒体、刊登报道的机会向您明示交易信息。并向您提供参与汇大师论坛和社交活动的机会。<br>

                <p>
                    第六条  汇大师与合作经纪商的关联
                </p>
                1. 汇大师所选择的合作经纪商均为经过严格筛选、审核，具有从事相关行业牌照，且受相关机构或部门监管的合法、正规平台。<br>
                2. 如您在使用合作经纪商提供的信息中存在交易系统故障、收费或数据错误、误导性陈述或任何不当行为等引发的任何损失，汇大师概不承担任何责任。<br>
                3. 您在使用合作经纪商平台前，请您仔细阅读该平台的相关协议条款，审查其有关交易系统错误、隐私、计费错误和遗漏等相关政策。<br>
                4. 汇大师是经合作经纪商授权发布信息的第三方平台，不提供交易系统软件及交易技术支持，也不对交易资金作任何担保。您使用合作经纪商平台交易的资金风险和使用交易系统存在的任何风险，汇大师概不承担任何法律责任。<br>
                5. 合作经纪商网站提供的信息与汇大师没有关联，汇大师没有任何实质审查和形式审查的义务，对于合作经纪商网站给您提供的信息，汇大师不作任何担保或投资建议，由您自行筛选信息。<br>
                6. 汇大师不保证您使用合作经纪商网站信息必定带来利润。请知晓您使用信号供应商和传播本网站信息可能会存在风险。若您坚持使用合作经纪商网站的信息，您需自行承担责任。<br>
                7. 汇大师不保证其信息和统计数据的完整性及准确性。由合作经纪商给您提供的信息和统计数据导致的任何结果，汇大师不承担任何损失赔偿。<br>
                8. 因行情突发性或经纪商银行的流通性等问题所引起的，阻止订单以有利的价格执行的状况，联系经纪商协商解决。针对交易不能执行的市场状况，汇大师不承担任何损失赔偿。<br>

                <p>
                    第七条  免责条款
                </p>
                1. 如您使用网络设备（如电脑、移动设备等包括硬件、软件等）交易发生错误（如网络信号的传输错误、延迟、中断、网络信号的强弱造成的错误、数据错误以及设备连接的稳定性造成的错误等），所造成的直接的、间接的、偶发性的损失损益，均由您本人承担，汇大师一概不负任何责任。<br>
                2. 汇大师和提供信号服务的合作经纪商都不承诺网络交易不会中断或不会出现信息错误，也不担保网络在交易系统所提供的信息、服务、交易的时效性、准确性、完整性和可靠性，因此汇大师不承担以上情况导致的任何损失。<br>
                3. 如汇大师电子服务系统任何计算机病毒、蠕虫病毒、软件炸弹或其他类似病毒侵入客户计算机软件或硬件中，并且汇大师已采取合理措施防止该侵入的发生，汇大师不对您承担任何责任。<br>
                4. 如果发生任何超出汇大师控制范围内的不可抗力事件（如技术事件中的系统故障、客户终端延迟更新、不正确安装、网络连接故障、合理控制外的安全漏洞等）所给您造成的财产损失，汇大师将不承担由此事件产生的任何索赔及损失。<br>
                5. 建议您应谨慎使用iPhone、Android手机等移动设备进行交易或接收数据，因移动设备会受到3G、WiFi和GPRS网络的限制，可能无法提供与通过web浏览器访问汇大师平台时相同的功能。如您使用移动设备产生的任何损失、损害、成本或费用，包括但不限于利润损失，使用时所产生的直接的、间接的或偶发性的损害损失，汇大师一律不负任何责任。<br>

                <p>
                    第八条  协议的生效、修改、终止
                </p>
                本协议从您在汇大师平台开设交易员账户当日起开始生效，直至双方一致同意本协议终止或一方违约时终止。任何一方均可终止本协议。但是需要事先书面或以邮件的形式通知。汇大师接到通知后，将在7个工作日内书面或邮件通知终止本协议。

                <p>
                    第九条  法律适用与争议解决
                </p>
                本协议之订立、生效、解释、变更、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如无相关法律规定的，则应参照通用国际商业惯例及/或行业惯例。<br>
                因本协议产生的一切争议应由您与汇大师的经营者协商解决。协商解决不成的，您同意由上汇大师所在地人民法院诉讼解决。




            </div>

            <div class="phone_input_content cl">
                <input type="text" placeholder="请输入手机验证码" name="手机验证码" v-model="form.verify_phone" maxlength="6" v-validate data-vv-rules="required|msgCode" >
                <span :class="{disabled:codeDelay>0}"  @click="sendCode">{{codeDelay>0?codeDelay+'s后重新发送':'发送验证码'}}</span>
                <p id="verify_phone_warning" v-if="errors.has('手机验证码')">{{ errors.first('手机验证码') }}</p>
            </div>
            <div class="checkBox_content">
                <Checkbox v-model="agreementCheckbox"></Checkbox>
                我已阅读并接受
                <span @click="showAgreement">《交易员入驻协议》</span>
            </div>
            <div id="btn_content">
                <div class="btn" :class="{polar:!agreementCheckbox,pitch:agreementCheckbox}"  @click="sign">点击签署</div>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        data () {
            return {
                agreement: true,
                agreementCheckbox: false,
                iviewModal: false,
                form: {
                    reserved_phone: '',
                    verify_phone: ''
                },
                codeDelay:0
            }
        },
        props: ["userMsg"],
        beforeMount () {
            if(this.util.isEmpty(this.userMsg.hasBankNumber)){
                this.$router.replace({
                    path: '/becomeTrader/step1'
                })
                return
            }
            this.form.reserved_phone = this.userMsg.reserved_phone

            //倒计时
            const traderSignUpCodeRecode = this.util.getData('signUpCodeRecode', 60)
            if (!this.util.isEmpty(traderSignUpCodeRecode)) {
                this.codeDelay = 60 - parseInt((new Date().getTime() - traderSignUpCodeRecode) / 1000)
                this.countCodeDelay()
            }
        },
        methods: {
            hideAgreement () {
                this.agreement = false;
            },
            showAgreement () {
                this.agreement = true;
            },
            //获取验证码
            sendCode() {
                if(this.codeDelay>0){
                    return
                }
                const httpName = "验证码发送"
                this.$http.get('/user/for_check_identity',{})
                    .then((response) => {
                         const data = response.data
                         const {retCode,retMsg} = data
                        if(retCode == '0'){
                             this.codeDelay = 60
                            this.util.setData('signUpCodeRecode', new Date().getTime())
                            this.countCodeDelay()
                            this.$Message.success({content: `${httpName}成功`})
                         }else {
                             this.$Modal.error({title: `${httpName}失败`, content: retMsg})
                         }
                    })
                    .catch((error) => {
                        this.$Modal.error({title: `${httpName}失败`, content: this.util.getHttpText(error)})
                    })
            },

            //点击签署
            sign () {
                if(!this.agreementCheckbox){ return }
                var ajaxData = {
                    verify_phone:this.form.verify_phone
                }
                const httpName = "签署成为交易员"
                this.$http.post('/trader/sign_trader',ajaxData)
                    .then((response) => {
                        const data = response.data
                        const {retCode,retData}=data
                        if (retCode == '0') {
                            this.iviewModal = true
                        }else {
                            this.$Modal.error({title: `${httpName}失败+`, content: data.retMsg})
                        }
                    })
                    .catch((error) => {
                        this.$Modal.error({title: `${httpName}失败-`, content: this.util.getHttpText(error)})
                    })
            },

            know () {
                this.iviewModal = false;
                this.$router.push({
                    path: '/home'
                })
            },
            //验证码倒计时
            countCodeDelay(){
                if (!(this.codeDelay > 0)) {
                    return
                }
                const count = this.codeDelay;
                this.util.interval(() => {
                    this.codeDelay--
                }, 1000, count)
            }
        }
    }
</script>